ryankurte/efm32-base/hardware/kit/common/bsp/thunderboard/board_4166.c
    sensorInfo.enabled |= BOARD_ENABLED_HALL;
  } else {
    /* Enable pin */
    GPIO_PinOutClear(BOARD_HALL_PORT, BOARD_HALL_ENABLE_PIN);

    /* Setup I2C pins */
    GPIO_PinModeSet(BOARD_HALL_PORT, BOARD_HALL_I2C_SDA_PIN, gpioModeDisabled, 0);
    GPIO_PinModeSet(BOARD_HALL_PORT, BOARD_HALL_I2C_SCL_PIN, gpioModeDisabled, 0);

    /* OUT1 pin */
    GPIO_PinModeSet(BOARD_HALL_PORT, BOARD_HALL_OUTPUT_PIN, gpioModeDisabled, 0);

    sensorInfo.enabled &= ~BOARD_ENABLED_HALL;
  }

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Enables or disables the Hall sensor GPIO interrupt
 *
 * @param[in] enable
 *    Set true to enable, false to disable
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_hallSensorEnableIRQ(bool enable)
{
  GPIO_ExtIntConfig(BOARD_HALL_PORT, BOARD_HALL_OUTPUT_PIN, EXTI_HALL_OUT1, true, true, enable);

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Enables or disables the environmental sensor group (Pressure, RH/Temp,
 *    UV/Ambient light and Hall sensors) GPIO interrupts
 *
 * @param[in] enable
 *    Set true to enable, false to disable
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_envSensEnableIRQ(bool enable)
{
  /* Just for backward compatibility reasons */
  GPIO_ExtIntConfig(BOARD_UV_ALS_INT_PORT, BOARD_UV_ALS_INT_PIN, EXTI_UV_ALS_INT, false, true, enable);

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Enables or disables the MEMS microphone
 *
 * @param[in] enable
 *    Set true to enable, false to disable
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_micEnable(bool enable)
{
  if ( enable ) {
    GPIO_PinOutSet(BOARD_MIC_ENABLE_PORT, BOARD_MIC_ENABLE_PIN);
  } else {
    GPIO_PinOutClear(BOARD_MIC_ENABLE_PORT, BOARD_MIC_ENABLE_PIN);
  }

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Enables or disables the Air Quality / Gas Sensor
 *
 * @param[in] enable
 *    Set true to enable, false to disable
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_gasSensorEnable(bool enable)
{
  if ( enable ) {
    sensorInfo.enabled |= BOARD_ENABLED_GAS;
  } else {
    sensorInfo.enabled &= ~BOARD_ENABLED_GAS;
  }

  if ( enable ) {
    /* Enable pin */
    GPIO_PinOutSet(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_ENABLE_PIN);

    /* Setup I2C pins */
    GPIO_PinModeSet(BOARD_CCS811_I2C_PORT, BOARD_CCS811_I2C_SDA_PIN, gpioModeWiredAnd, 1);
    GPIO_PinModeSet(BOARD_CCS811_I2C_PORT, BOARD_CCS811_I2C_SCL_PIN, gpioModeWiredAnd, 1);

    /* Wake pin */
    GPIO_PinModeSet(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_WAKE_PIN, gpioModePushPull, 1);
  } else {
    /* Wake pin */
    GPIO_PinModeSet(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_WAKE_PIN, gpioModeDisabled, 0);

    /* Setup I2C pins */
    GPIO_PinModeSet(BOARD_CCS811_I2C_PORT, BOARD_CCS811_I2C_SDA_PIN, gpioModeDisabled, 0);
    GPIO_PinModeSet(BOARD_CCS811_I2C_PORT, BOARD_CCS811_I2C_SCL_PIN, gpioModeDisabled, 0);

    /* Enable pin */
    GPIO_PinOutClear(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_ENABLE_PIN);
  }

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Wakes up the Air Quality / Gas Sensor
 *
 * @param[in] wake
 *    Set true to wake up, false otherwise
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_gasSensorWake(bool wake)
{
  if ( wake ) {
    GPIO_PinOutClear(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_WAKE_PIN);
    UTIL_delay(10);
  } else {
    GPIO_PinOutSet(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_WAKE_PIN);
    UTIL_delay(10);
  }

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Enables or disables the Air Quality / Gas Sensor GPIO interrupt
 *
 * @param[in] enable
 *    Set true to enable, false to disable
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_gasSensorEnableIRQ(bool enable)
{
  GPIO_ExtIntConfig(BOARD_CCS811_CTRL_PORT, BOARD_CCS811_INT_PIN, EXTI_CCS811_INT, false, true, enable);

  return BOARD_OK;
}

/***************************************************************************//**
 * @brief
 *    Sets up the route register of the I2C device to use the correct
 *    set of pins
 *
 * * @param[in] select
 *    The I2C bus route to use (None, Environmental sensors, Gas sensor, Hall
 *    sensor)
 *
 * @return
 *    Returns zero on OK, non-zero otherwise
 ******************************************************************************/
uint32_t BOARD_i2cBusSelect(uint8_t select)
{
  uint32_t status;

  status = BOARD_OK;

  switch ( select ) {
    case BOARD_I2C_BUS_SELECT_NONE:
      I2C1->ROUTEPEN  = 0;
      I2C1->ROUTELOC0 = 0;
      sensorInfo.busInUse = BOARD_I2C_BUS_SELECT_NONE;
      break;

    case BOARD_I2C_BUS_SELECT_ENV_SENSOR:
      I2C1->ROUTELOC0 = BOARD_ENV_I2C_ROUTELOC0;
      I2C1->ROUTEPEN = (I2C_ROUTEPEN_SCLPEN | I2C_ROUTEPEN_SDAPEN);
      sensorInfo.busInUse = BOARD_I2C_BUS_SELECT_ENV_SENSOR;
      break;

    case BOARD_I2C_BUS_SELECT_GAS:
      I2C1->ROUTELOC0 = BOARD_CCS811_I2C_ROUTELOC0;
      I2C1->ROUTEPEN = (I2C_ROUTEPEN_SCLPEN | I2C_ROUTEPEN_SDAPEN);
      sensorInfo.busInUse = BOARD_I2C_BUS_SELECT_GAS;
      break;

    case BOARD_I2C_BUS_SELECT_HALL:
      I2C1->ROUTELOC0 = BOARD_HALL_I2C_ROUTELOC0;
      I2C1->ROUTEPEN = (I2C_ROUTEPEN_SCLPEN | I2C_ROUTEPEN_SDAPEN);
      sensorInfo.busInUse = BOARD_I2C_BUS_SELECT_HALL;
      break;

    default:
      status = BOARD_ERROR_I2C_BUS_SELECT_INVALID;
  }

